app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 1], ["created_at", "2022-01-11 04:08:17.311980"], ["updated_at", "2022-01-11 04:08:17.311980"]]
---
    def new
        current_user.profile.experiences.create