app/controllers/users_controller.rb

INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 7], ["created_at", "2022-01-09 02:26:15.572494"], ["updated_at", "2022-01-09 02:26:15.572494"]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "educations" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 10], ["created_at", "2022-01-09 02:26:15.582693"], ["updated_at", "2022-01-09 02:26:15.582693"]]
INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 2], ["created_at", "2022-01-09 08:57:45.742178"], ["updated_at", "2022-01-09 08:57:45.742178"]]
---
    def signed

       # puts params[:name]
       # puts params[:email]
       # puts params[:password]
        user = User.new({name: params[:name], email:params[:email], password:params[:password]})

        user.profile = Profile.new
        user.save
        user.profile.educations.create
        user.profile.experiences.create